{"data":{"tag":{"title":"The Babe Rainbow","belongsTo":{"pageInfo":{"totalPages":1,"currentPage":1},"edges":[{"node":{"date":"2018-08-04T13:34:15","id":"64","title":"A psychedelic summer triptych","path":"/2018/08/04/psychedelic-summer-triptych","content":"\n<p>As far as I could remember, in the current year we are experiencing one of the most untypical summers. Cloudy days and temperatures below 40 degrees Celsius. I like this kind of weather since I am not a huge fan of the continental summers and extremely high temperatures (but then again, who is?). The summer heat makes me numb. It blurs my mind and it takes away the ability to think rationally. Each time the sun obliterates we me with radiation, I think of Meursault and his silly justification that he shoot the Arab only due to the sun blinding him.</p>\n\n\n\n<p>However, even though I can’t take the heat, I can’t help liking the summer and all that it symbolizes: vitality, youth, energy, romance, passion. I like the summer relaxation and carelessness. The unique feeling that you are on your summer break, even though long time has passed since the last time being so. The summer melancholy, the pink sunsets, the sudden night breeze that carries freshness. Watermelon. The beach. White legs on the send&#8230;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img data-opt-src=\"https://ml6h13xawk1g.i.optimole.com/Al67Mnc.28qX~ddaf/w:1024/h:581/q:82/https://missalbini.mk/wp-content/uploads/2020/06/IMG_20180804_135307_517.jpg\"  width=\"1024\" height=\"581\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%201024%20581%22%20width%3D%221024%22%20height%3D%22581%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" alt=\"\" class=\"wp-image-67\"/><noscript><img width=\"1024\" height=\"581\" src=\"https://ml6h13xawk1g.i.optimole.com/Al67Mnc.28qX~ddaf/w:1024/h:581/q:82/https://missalbini.mk/wp-content/uploads/2020/06/IMG_20180804_135307_517.jpg\" alt=\"\" class=\"wp-image-67\"/></noscript></figure>\n\n\n\n<p>Each summer has its own soundtrack and I could say that I already have the sound of the summer of 2018. The last few months, three albums have been played the most frequently on our sound system: Wooden Shjips – V, The Babe Rainbow – Double Rainbow and Triptides – Visitors. All were released very recently, and besides having the same hook of psychedelia, they all embrace the sound of the summer.</p>\n\n\n\n<h4><strong>Wooden Shjips &#8211; V&nbsp;</strong>(May 2018)</h4>\n\n\n\n<figure class=\"wp-block-embed-youtube aligncenter wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe title=\"Wooden Shjips ‎– V.(Full Album)\" width=\"740\" height=\"416\" src=\"https://www.youtube.com/embed/1HYT8sEDl0U?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Is there something else to expect from a record whose front cover depicts two fingers up in the air calling for peace? V is the fifth album of the San Francisco psychedelic rockers who, even though becoming increasingly mellower with each new record, they still manage to hold their own distinctive sound. Cheerful melodies that shine with positive energy and optimism. <s>Next September we will have the opportunity to see them live on Zdravo Mladi Festival, and this is the best news so far this year.</s></p>\n\n\n\n<h4><strong>The Babe Rainbow &#8211; Double Rainbow&nbsp;</strong>(July2018)</h4>\n\n\n\n<figure class=\"wp-block-embed-youtube aligncenter wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-4-3 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe title=\"The Magician\" width=\"740\" height=\"555\" src=\"https://www.youtube.com/embed/x9hmJoSLeZo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>In the same manner as on their debut album, on their sophomore effort The Babe Rainbow once again reference the sound of the late ’60s and early ’70s. Yet, this time it is done with a more laid-back groove, lacking the funky and disco elements that they had on some tracks on their previous record. Double Rainbow&nbsp;is a record that brings the summer breeze feel, waves, surfers and sunny beaches.</p>\n\n\n\n<h4><strong>Triptides &#8211; Visitors</strong>&nbsp;(April 2018)</h4>\n\n\n\n<p>Triptides&nbsp;are a psychedelic rock band from Los Angeles, and Visitors is their sixth record so far. The first track “All my life” immediately sets a warm, positive and melodic beginning of the album. A similar summer ambient that evokes the era of the love revolution lurks from each corner of the album.</p>\n\n\n\n<p>*</p>\n\n\n\n<p>Thanks to the new psychedelic music, the summer of 2018 got its colors and sound of a summer from the late 1960s. The last couple of years I am making up for all the music that I have missed growing up in the era of grunge in which psychedelic rock was considered a kind of <em>passe</em>. Luckily, psychedelic rock is having a comeback riding on a new wave of the bands that make music that sounds as if it was recorded late in the 1960s, long forgotten on a shelf and rediscovered once again. It is a dose of a old-new psychedelic sound which is much needed in this digital era of crunched decibels and no sense of subtlety in music production.</p>\n","excerpt":"<p>As far as I could remember, in the current year we are experiencing one of the most untypical summers. Cloudy days and temperatures below 40 degrees Celsius. I like this kind of weather since I am not a huge fan of the continental summers and extremely high temperatures (but then again, who is?). The summer&#8230;</p>\n","categories":[{"id":"5","title":"Our picks","path":"/category/our-picks"}]}}]}}},"context":{}}